In [573]:
import pandas as pd

In [574]:
claus = pd.read_csv("data/claustro.csv",sep = ";")

In [575]:
clase1=pd.read_csv("data/clase_1.csv", sep =";")

In [576]:
clase2=pd.read_csv("data/clase_2.csv", sep =";")

In [577]:
clase3=pd.read_csv("data/clase_3.csv", sep =";")

In [578]:
clase4=pd.read_csv("data/clase_4.csv", sep =";")

In [579]:
total_clases= pd.read_csv("data/total_clases.csv")

In [580]:
claus.head()

              Nombre Rol Vertical   Promocion    Campus   Modalidad
0          Noa Yáñez  TA       DS  Septiembre    Madrid  Presencial
1  Saturnina Benitez  TA       DS  Septiembre    Madrid  Presencial
2         Anna Feliu  TA       FS  Septiembre    Madrid  Presencial
3      Rosalva Ayuso  TA       FS  Septiembre  Valencia  Presencial
4   Ana Sofía Ferrer  TA       FS     Febrero  Valencia  Presencial

------------------

--------------------------

In [581]:
total_clases.drop(columns="Unnamed: 0",inplace=True)

In [582]:
total_clases.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto,Calificación
0,Jafet Casals,Jafet_Casals@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto
1,Jorge Manzanares,Jorge_Manzanares@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto
2,Onofre Adadia,Onofre_Adadia@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto
3,Merche Prada,Merche_Prada@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto
4,Pilar Abella,Pilar_Abella@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto

-------------------

# **TABLAS**

1. **ALUMNOS**

In [583]:
alumnos = pd.DataFrame({"Nombre": total_clases["Nombre"].unique(),"Email":total_clases["Email"].unique()})
alumnos.insert(0, 'id_alumnos', range(1, len(alumnos) + 1))

In [584]:
alumnos.head()

   id_alumnos            Nombre                       Email
0           1      Jafet Casals      Jafet_Casals@gmail.com
1           2  Jorge Manzanares  Jorge_Manzanares@gmail.com
2           3     Onofre Adadia     Onofre_Adadia@gmail.com
3           4      Merche Prada      Merche_Prada@gmail.com
4           5      Pilar Abella      Pilar_Abella@gmail.com

-------------------------

2. **VERTICALES**

In [585]:
verticales= pd.DataFrame({"Nombre":claus["Vertical"].unique()})
verticales.insert(0, 'id_verticales', range(1, len(verticales) + 1))

In [586]:
verticales.head()

   id_verticales Nombre
0              1     DS
1              2     FS

-----------------------------------

3. **CAMPUS**

In [587]:
campus= pd.DataFrame({"Nombre":total_clases["Campus"].unique()})
campus.insert(0, 'id_campus', range(1, len(campus) + 1))

In [588]:
campus.head()

   id_campus    Nombre
0          1    Madrid
1          2  Valencia

-----------------------

4. **CLAUSTRO**

In [589]:
claustro1=pd.DataFrame({"nombre":claus["Nombre"],"vertical":claus["Vertical"],"Rol":claus["Rol"]})
claustro1.insert(0, 'id_profesor', range(1, len(claustro1) + 1))

In [590]:
claustro = pd.merge(claustro1, verticales, left_on='vertical', right_on='Nombre', how='left')
claustro= claustro.loc[:,["id_profesor","nombre","id_verticales","Rol"]]
claustro

   id_profesor              nombre  id_verticales Rol
0            1           Noa Yáñez              1  TA
1            2   Saturnina Benitez              1  TA
2            3          Anna Feliu              2  TA
3            4       Rosalva Ayuso              2  TA
4            5    Ana Sofía Ferrer              2  TA
5            6     Angélica Corral              2  TA
6            7         Ariel Lledó              1  TA
7            8         Mario Prats              2  LI
8            9   Luis Ángel Suárez              2  LI
9           10  María Dolores Diaz              1  LI

-------------------------------

5. **MODALIDAD**

In [591]:
claus['Modalidad'] = claus['Modalidad'].replace({'Presencial': True, 'Online': False})#cambiamos a bool los datos

C:\Users\UX490U\AppData\Local\Temp\ipykernel_2892\1859943582.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  claus['Modalidad'] = claus['Modalidad'].replace({'Presencial': True, 'Online': False})#cambiamos a bool los datos

In [592]:
modalidad=pd.DataFrame({"Presencial":claus['Modalidad'].unique()})
modalidad.insert(0, 'id_modalidad', range(1, len(modalidad) + 1))
modalidad['FullTime'] = [True,False]

In [593]:
modalidad.loc[2]=[3,True,False]

In [594]:
modalidad.loc[3]=[4,False,True]

In [595]:
modalidad

   id_modalidad  Presencial  FullTime
0             1        True      True
1             2       False     False
2             3        True     False
3             4       False      True

----------------------------

6. **PROYECTOS**

In [596]:
vertical_rules = {
    "FS": ['Proyecto_WebDev', 'Proyecto_FrontEnd', 'Proyecto_Backend', 
           'Proyecto_React', 'Proyecto_FullSatck'],
    "DS": ['Proyecto_HLF', 'Proyecto_EDA', 'Proyecto_BBDD', 'Proyecto_ML',
       'Proyecto_Deployment']
}#si hay nuevos proyectos o nuevas verticales solo añadimos al diccionario

In [597]:
def asignar_vertical(proyecto):
    for vertical, proyectos in vertical_rules.items():
        if proyecto in proyectos:
            return vertical
    return 'Desconocido'

In [598]:
total_clases["Vertical"] = total_clases["Proyecto"].apply(asignar_vertical)

In [599]:
proyectos1 = total_clases.groupby("Proyecto")["Vertical"].unique().reset_index()
proyectos1["Vertical"] = proyectos1["Vertical"].str[0]#quitar corquetes de las listas generadas [DS]
proyectos1.insert(0, 'id_proyecto', range(1, len(proyectos1) + 1))

In [600]:
proyectos = pd.merge(proyectos1, verticales, left_on='Vertical', right_on='Nombre', how='left')
proyectos= proyectos.loc[:,["id_proyecto","Proyecto","id_verticales"]]
proyectos

   id_proyecto             Proyecto  id_verticales
0            1        Proyecto_BBDD              1
1            2     Proyecto_Backend              2
2            3  Proyecto_Deployment              1
3            4         Proyecto_EDA              1
4            5    Proyecto_FrontEnd              2
5            6   Proyecto_FullSatck              2
6            7         Proyecto_HLF              1
7            8          Proyecto_ML              1
8            9       Proyecto_React              2
9           10      Proyecto_WebDev              2

---------------------------

7. **BOOTCAMP**

In [601]:
bootcamp1=pd.DataFrame({"Promocion":total_clases["Promoción"],"F_comienzo":total_clases["Fecha_comienzo"],
                        "campus":total_clases["Campus"],"vertical":total_clases["Vertical"]})

In [602]:
bootcamp= pd.merge(bootcamp1, verticales, left_on='vertical', right_on='Nombre', how='left')
bootcamp= pd.merge(bootcamp, campus, left_on='campus', right_on='Nombre', how='left')
bootcamp["id_modalidad"]=modalidad.iloc[0,0]
bootcamp=bootcamp.drop_duplicates(["Promocion","F_comienzo","id_campus","id_modalidad","id_verticales"]).reset_index()
bootcamp.insert(0, 'id_bootcamp', range(1, len(bootcamp) + 1))
bootcamp.drop(columns="index",inplace=True)
bootcamp_cruce = bootcamp
bootcamp_cruce

,id_bootcamp,Promocion,F_comienzo,campus,vertical,id_verticales,Nombre_x,id_campus,Nombre_y,id_modalidad
0,1,Septiembre,18/09/2023,Madrid,DS,1,DS,1,Madrid,1
1,2,Febrero,12/02/2024,Madrid,DS,1,DS,1,Madrid,1
2,3,Septiembre,18/09/2023,Madrid,FS,2,FS,1,Madrid,1
3,4,Febrero,12/02/2024,Valencia,FS,2,FS,2,Valencia,1

In [603]:
bootcamp=bootcamp.loc[:,['id_bootcamp',"Promocion","F_comienzo","id_campus","id_verticales","id_modalidad"]]

In [604]:
bootcamp

   id_bootcamp   Promocion  F_comienzo  id_campus  id_verticales  id_modalidad
0            1  Septiembre  18/09/2023          1              1             1
1            2     Febrero  12/02/2024          1              1             1
2            3  Septiembre  18/09/2023          1              2             1
3            4     Febrero  12/02/2024          2              2             1

-------------------------------

8. **CALIFICACIONES**

In [605]:
total_clases["Calificación"] = total_clases["Calificación"] .replace({'Apto': True, 'No Apto': False})#cambiamos a bool los datos

C:\Users\UX490U\AppData\Local\Temp\ipykernel_2892\440748375.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  total_clases["Calificación"] = total_clases["Calificación"] .replace({'Apto': True, 'No Apto': False})#cambiamos a bool los datos

In [606]:
calificaciones1=pd.DataFrame({"nombre_alumnos":total_clases["Nombre"],"nombre_proyecto":total_clases["Proyecto"],"Nota":total_clases["Calificación"]})
calificaciones1.insert(0, 'id_calificaciones', range(1, len(calificaciones1) + 1))

In [607]:
calificaciones= pd.merge(calificaciones1, alumnos, left_on='nombre_alumnos', right_on='Nombre', how='left')
calificaciones= pd.merge(calificaciones, proyectos, left_on='nombre_proyecto', right_on='Proyecto', how='left')
calificaciones=calificaciones.loc[:,["id_calificaciones","id_alumnos","id_proyecto","Nota"]]

In [608]:
calificaciones.head()

   id_calificaciones  id_alumnos  id_proyecto  Nota
0                  1           1            7  True
1                  2           2            7  True
2                  3           3            7  True
3                  4           4            7  True
4                  5           5            7  True

-----------------

9. **ALUMNOS_CLASE**

In [609]:
a_alumnos = pd.merge(total_clases, bootcamp_cruce, left_on=['Promoción','Fecha_comienzo','Campus', 'Vertical'], right_on=['Promocion','F_comienzo','campus','vertical'], how='left')
a_alumnos = a_alumnos.loc[:,['Nombre','id_bootcamp']]
a_alumnos = pd.merge(a_alumnos, alumnos, left_on=['Nombre'], right_on=['Nombre'], how='left')
a_alumnos = a_alumnos.loc[:,['id_bootcamp', 'id_alumnos']]
a_alumnos.insert(0, 'id_aclase', range(1, len(a_alumnos) + 1))
a_alumnos

     id_aclase  id_bootcamp  id_alumnos
0            1            1           1
1            2            1           2
2            3            1           3
3            4            1           4
4            5            1           5
..         ...          ...         ...
255        256            4          48
256        257            4          49
257        258            4          50
258        259            4          51
259        260            4          52

[260 rows x 3 columns]

-----------------

10.**PROFESORES_CLASE**

In [610]:
bootcamp_cruce.head()

,id_bootcamp,Promocion,F_comienzo,campus,vertical,id_verticales,Nombre_x,id_campus,Nombre_y,id_modalidad
0,1,Septiembre,18/09/2023,Madrid,DS,1,DS,1,Madrid,1
1,2,Febrero,12/02/2024,Madrid,DS,1,DS,1,Madrid,1
2,3,Septiembre,18/09/2023,Madrid,FS,2,FS,1,Madrid,1
3,4,Febrero,12/02/2024,Valencia,FS,2,FS,2,Valencia,1

In [611]:
claus.head()

              Nombre Rol Vertical   Promocion    Campus  Modalidad
0          Noa Yáñez  TA       DS  Septiembre    Madrid       True
1  Saturnina Benitez  TA       DS  Septiembre    Madrid       True
2         Anna Feliu  TA       FS  Septiembre    Madrid       True
3      Rosalva Ayuso  TA       FS  Septiembre  Valencia       True
4   Ana Sofía Ferrer  TA       FS     Febrero  Valencia       True

In [612]:
p_clase = pd.merge(claus, bootcamp_cruce, left_on=['Promocion','Campus', 'Vertical'], right_on=['Promocion','campus','vertical'], how='left')
p_clase = p_clase.loc[:,['Nombre','id_bootcamp']]
p_clase = pd.merge(p_clase, claustro, left_on=['Nombre'], right_on=['nombre'], how='left')
p_clase = p_clase.loc[:,['id_bootcamp', 'id_profesor']]
p_clase.insert(0, 'id_pclase', range(1, len(p_clase) + 1))
p_clase.dropna(inplace=True)

In [613]:
p_clase["id_bootcamp"] = p_clase["id_bootcamp"].astype("int")

In [614]:
p_clase.head()

   id_pclase  id_bootcamp  id_profesor
0          1            1            1
1          2            1            2
2          3            3            3
4          5            4            5
6          7            1            7

-------------

PRUEBAS

In [615]:
a_clase=a_alumnos
a_clase.rename(columns={"id_alumnos":"id_alumno"},inplace=True)

In [616]:
a_calse_p=a_clase.head()

In [617]:
alumnos.rename(columns={"Nombre":"nombre","Email":"email"},inplace=True)

In [618]:
alumnos_p=alumnos.head()

In [619]:
bootcamp.rename(columns={"Promocion":"promocion","F_comienzo":"f_comienzo","id_verticales":"id_vertical"},inplace=True)

In [620]:
bootcamp_p=bootcamp.head()

In [622]:
calificaciones.rename(columns={"id_calificaciones":"id_calif","id_alumnos":"id_alumno","Nota":"nota"},inplace=True)

In [623]:
calificaciones_p=calificaciones.head()

In [625]:
campus.rename(columns={"Nombre":"nombre"},inplace=True)

In [626]:
campus_p=campus.head()

In [628]:
claustro.rename(columns={"id_verticales":"id_vertical","Rol":"rol"},inplace=True)

In [630]:
claustro_p=claustro.head()

In [632]:
modalidad.rename(columns={"Presencial":"presencial","FullTime":"fulltime"},inplace=True)

In [633]:
modalidad_p=modalidad

In [635]:
p_clase_p=p_clase.head()

In [637]:
proyectos.rename(columns={"Proyecto":"nombre","id_verticales":"id_vertical"},inplace=True)

In [638]:
proyectos_p=proyectos.head()

In [640]:
verticales.rename(columns={"Nombre":"nombre","id_verticales":"id_vertical"},inplace=True)

In [641]:
verticales_p=verticales

DICCIONARIOS

In [642]:
dic_sql={"a_clase":a_clase,
     "alumnos":alumnos,
     "bootcamp":bootcamp,
     "calificaciones":calificaciones,
     "campus":campus,
     "claustro":claustro,
     "modalidad":modalidad,
     "p_clase":p_clase,
     "proyectos":proyectos
     }